app/Controllers/Api.php

SELECT *
FROM `utilisateurs`
WHERE `email` = 'guhu@o.c'
 LIMIT 1
---
    public function checkEmail()
    {
        $email = $this->request->getPost('email');

        if (empty($email)) {
            return $this->response->setJSON(['exists' => false]);
        }

        $utilisateurModel = new Utilisateur();
        $utilisateur = $utilisateurModel->where('email', $email)->first();