app/Controllers/InscriptionController.php

    public function finaliser()
    {

        $db = \Config\Database::connect();
        $utilisateurModel = new UtilisateurModel();
        $santeModel = new HistoriqueSanteModel();

        $db->transStart();

        $userdata = [
            'nom'           => session()->get('nom'),
            'prenom'        => session()->get('prenom'),
            'email'         => session()->get('email'),
            'genre'         => session()->get('genre'),
            'mot_de_passe'  => password_hash(session()->get('mot_de_passe'), PASSWORD_DEFAULT),
            'taille'        => $this->request->getPost('taille'),
            'poids'         => $this->request->getPost('poids'),
            'role'          => 'client',
            'porte_monnaie' => 0,
            'est_gold'      => 0
        ];

        $utilisateurModel->insert($userdata);
---
INSERT INTO `utilisateurs` (`nom`, `prenom`, `email`, `genre`, `mot_de_passe`, `role`, `est_gold`) VALUES ('Test', 'inscrpition', 'inscription@gmail.com', 'M', '$2y$10$XBYrXQZw23Pq8YKxoW0xzuHrB5WKQ79rTEKJ2oFH4Ct7bbNr0xRkC', 'client', 0)

    public function checkEmail()
    {
        $email = $this->request->getPost('email');
        $model = new UtilisateurModel();
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `utilisateurs`
WHERE `email` = 'Ma@gmail.co'
 LIMIT 1