app/Controllers/RegimeController.php

    public function index()
    {
        $regimeModel = new \App\Models\RegimeModel();
        $data['regimes'] = $regimeModel->findAll();
---
SELECT *
FROM `regime`