app/Models/CodeRechargeModel.php

SELECT *
FROM `code_recharge`
WHERE `code` = 'CODE5-002'
 LIMIT 1
---
    public function getByCode($code){
        return $this->where('code', $code)->first();