app/Models/PortefeuilleModel.php

    public function getPortefeuille(int $idUtilisateur){
        return $this->where('id_utilisateur', $idUtilisateur)->first();
---
SELECT *
FROM `portefeuille`
WHERE `id_utilisateur` = 2
 LIMIT 1