app/Models/UtilisateurModel.php

    public function login($email, $password)
    {
        $user = $this->where('email', $email)->first();
---
SELECT *
FROM `utilisateurs`
WHERE `email` = 'client@test.com'
 LIMIT 1

    public function getNombresClients()
    {
        return $this->where('role', 'CLIENT')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `utilisateurs`
WHERE `role` = 'CLIENT'